# Создание собственного образа на основе образа Node.js версии 18.17.0 с Alpine Linux
FROM node:18.17.0-alpine

# Установка рабочей директории /app внутри контейнера
WORKDIR /app

# Копирование package.json и package-lock.json (если есть) в рабочую директорию контейнера
COPY package.json package-lock.json* /app/

# Установка зависимостей проекта внутри контейнера
RUN npm install

# Копирование всех файлов проекта в рабочую директорию контейнера
COPY . .

# Определение переменной окружения PORT со значением по умолчанию 3000 (если не передано при запуске контейнера)
ENV PORT=3000

# Открытие порта, на котором работает приложение, для доступа с хостовой системы
EXPOSE $PORT

# Команда запуска приложения при старте контейнера
CMD ["node", "server.js"]
